Autodesk.Revit.DB.IndependentTag.SetIsLeaderVisible(Autodesk.Revit.DB.Reference,System.Boolean)
Set tag's leader that points to specified reference to be visible or not. This option can be set only if the LeadersPresentationMode is ShowSpecificLeaders.
referenceTagged:
The reference which is tagged.
visible:
True for showing the leader, false to hide it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The LeadersPresentationMode should be set to ShowSpecificLeaders.
Since:
2023

Autodesk.Revit.DB.IndependentTag.IsLeaderVisible(Autodesk.Revit.DB.Reference)
Returns if leader that points to specified reference is visible or not.
referenceTagged:
The reference which is tagged.
Returns:
Returns true if leader that points to specified reference is visible, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.IndependentTag.RemoveReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Removes the provided list of references from the tag's list of references.
referencesToRemove:
References to be removed from tag.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all tagged before removing them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.AddReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Adds the provided list of references to the tag's list of references.
Remarks:
The references must pass the following requirements to be added:
Must not be already tagged.Must be of the same category when TagMode is TM_ADDBY_CATEGORY.Must be taggable by this tag type.
If any of the above rules is not fulfilled, the execution will be stopped and an exception will be thrown
referencesToTag:
References to be tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The operation failed. Please verify that the references are all taggable and that they are not already tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This type of tag does not support multiple references.
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderEnd(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the end position of the tag's leader that points to specified reference.
Remarks:
Tags with attached leaders or no leaders do not support leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
referenceTagged:
The reference which is tagged.
pointEnd:
Point representing the end position of tag's leader
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader end because the tag does not use a free end leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetLeaderEnd(Autodesk.Revit.DB.Reference)
Returns the end position of the tag's leader that points to specified reference.
Remarks:
Tags with attached leaders or no leaders do not support leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
referenceTagged:
The reference which is tagged.
Returns:
Point representing the end position of tag's leader
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no leader end because the tag does not use a free end leader or the leader is not visible.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.SetLeaderElbow(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Set the position of the elbow of the tag's leader that points to specified reference.
If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.
Remarks:
Straight leaders do not have elbow points.
referenceTagged:
The reference which is tagged.
elbowPosition:
The position of the elbow.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
-or-
The leader for the tagged reference isn't visible.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.GetLeaderElbow(Autodesk.Revit.DB.Reference)
Returns the position of the elbow of the tag's leader that points to specified reference.
Position of leader's elbow.
Remarks:
Straight leaders do not have elbow points.
referenceTagged:
The reference which is tagged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference does not have a leader or its leader is straight.
-or-
The specified reference is not currently tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.HasLeaderElbow(Autodesk.Revit.DB.Reference)
Whether the tag's leader that points to the reference has an elbow point or not.
Returns:
True if the reference has a leader with an elbow point, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified reference is not currently tagged.
-or-
The leader for the tagged reference isn't visible.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IndependentTag.MergeElbows
Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: For this tag leaders are not allowed.
-or-
When setting this property: Can't merge elbows for tags that are part of a multi-reference annotation.
Since:
2023

Autodesk.Revit.DB.IndependentTag.LeadersPresentationMode
Identifies the Presentation Mode that is applied to tag leaders.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The LeadersPresentationMode LeadersPresentationMode.ShowOnlyOne or LeadersPresentationMode.ShowSpecificLeaders can't be set to a tag with only one leader.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: For this tag leaders are not allowed.
Since:
2023

Autodesk.Revit.DB.IndependentTag.HasLeader
Identifies if a tag has at least one visible leader, or if all leaders are hidden.
True if at least one leader is visible, false if all leaders are hidden. Setting the property to true, it will make all leaders visible.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: For this tag leaders are not allowed.